src/cf/maERP_ib/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеРасходы</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>Выручка</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>ВаловаяПрибыль</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/maERP_ib/src/AccumulationRegisters/ТоварыВНаличии/ТоварыВНаличии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВНаличии</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/maERP_ib/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/maERP_ib/src/InformationRegisters/ПлановыеПоказатели/ПлановыеПоказатели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПлановыеПоказатели</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>План</name>
    <type>
      <types>Characteristic.ПоказателиРасчётаПремий</types>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Факт</name>
    <type>
      <types>Characteristic.ПоказателиРасчётаПремий</types>
    </type>
  </resources>
  <resources>
    <name>ID</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ПоказателиРасчётаПремий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDРодитель</name>
    <comment>Для связи в виде &quot;Дерево&quot;</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/maERP_ib/src/AccumulationRegisters/ДополнительныеРасходы/ДополнительныеРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДополнительныеРасходы</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/maERP_ib/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХозяйственныеОперации</name>
  <enumValues>
    <name>АвансКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВКассу</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщика</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПоОтгрузкамТовара</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеОприходование</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеСписание</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеДенежныхСредствНаБанковскийСчет</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеНалоговИВзносов</name>
  </enumValues>
  <enumValues>
    <name>ПланируемыеЦеныЗакупки</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассы</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствСБанковскогоСчета</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПродажаВКредит</name>
  </enumValues>
  <enumValues>
    <name>ПрочееПоступлениеДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ПрочийРасходДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>РазукомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиенту</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>СнятиеНаличныхДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>СписаниеЗадолженности</name>
  </enumValues>
  <enumValues>
    <name>УстановкаЦенНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОбналичиваниеЧека</name>
  </enumValues>
  <enumValues>
    <name>ОперационныеЗатраты</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>Инкассация</name>
  </enumValues>
</mdclass:Enum>

src/cf/maERP_ib/src/AccumulationRegisters/Продажи/ManagerModule.bsl
#Область Формирование_движений

Процедура СформироватьДвижения(ДокОбъект) Экспорт
	Движения = ДокОбъект.Движения;
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		Ответственный = ДокОбъект.Ответственный;
		Рез = СформироватьДанные(ДокОбъект, ДокОбъект.ТЧТовары.Выгрузить(), ДокОбъект.Менеджер, ДокОбъект.Контрагент, ДокОбъект.Ссылка, ДокОбъект.ХозяйственнаяОперация, Ответственный, ДокОбъект.МестоХранения); 
		Движения.Продажи.Загрузить(Рез[4].Выгрузить());
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ВозвратОтПокупателя") И ЗначениеЗаполнено(ДокОбъект.Основание) Тогда	
		ТЗПартии = Движения.ТоварыВНаличии.Выгрузить();
		ТЗПартии.Свернуть("Номенклатура, Характеристика, Партия", "Количество");
		УменьшитьПрибыльПоВозврату(ДокОбъект, ТЗПартии);
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.КорректировкаДолга") Тогда 
		Если Не ОбщегоНазначенияВызовСервераПовтИсп.ЭтоРасчётыСПокупателями(ДокОбъект.ХозяйственнаяОперация) Тогда Возврат КонецЕсли;
		Мас = ДокОбъект.ДополнительныеСвойства.ТЗКредиторскаяЗадолженность.НайтиСтроки(Новый Структура("СПокупателем", Истина));
		Для Каждого Стр Из Мас Цикл
			ОбъектРасчётов = Стр.ОбъектРасчётов;
			Если Не ТипЗнч(Стр.ОбъектРасчётов) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда Продолжить; КонецЕсли;
			УменьшитьПрибыльПоКорректировке(ДокОбъект, ОбъектРасчётов, Стр.Сумма); 
		КонецЦикла;
		Мас = ДокОбъект.ДополнительныеСвойства.ТЗДебиторскаяЗадолженность.НайтиСтроки(Новый Структура("СПокупателем", Истина));
		Для Каждого Стр Из Мас Цикл
			ОбъектРасчётов = Стр.ОбъектРасчётов;
			Если Не ТипЗнч(Стр.ОбъектРасчётов) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда Продолжить; КонецЕсли;
			УменьшитьПрибыльПоКорректировке(ДокОбъект, ОбъектРасчётов, Стр.Сумма); 
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

Процедура УменьшитьПрибыльПоВозврату(ДокОбъект, ТЗВозврат)
	Движения = ДокОбъект.Движения;
	НЗ = РегистрыНакопления.Продажи.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(ДокОбъект.Основание);
	НЗ.Прочитать();
	ТЗПрибыль = НЗ.Выгрузить();
	Для Каждого Стр Из ТЗВозврат Цикл
		Мас = ТЗПрибыль.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Партия", Стр.Номенклатура, Стр.Характеристика, Стр.Партия));
		Для Каждого МасСтр Из Мас Цикл
			НС = Движения.Продажи.Добавить();
			ЗаполнитьЗначенияСвойств(НС, МасСтр);
			НС.Период = ДокОбъект.Дата;
			НС.ХозяйственнаяОперация = ДокОбъект.ХозяйственнаяОперация;
			НС.Количество = -Стр.Количество;
			НС.Себестоимость = -?(Стр.Количество = МасСтр.Количество, МасСтр.Себестоимость, МасСтр.Себестоимость / МасСтр.Количество * Стр.Количество);
			НС.ДополнительныеРасходы = -?(Стр.Количество = МасСтр.Количество, МасСтр.ДополнительныеРасходы, МасСтр.ДополнительныеРасходы / МасСтр.Количество * Стр.Количество);
			НС.Выручка = -?(Стр.Количество = МасСтр.Количество, МасСтр.Выручка, МасСтр.Выручка / МасСтр.Количество * Стр.Количество);
			НС.НДС = -?(Стр.Количество = МасСтр.Количество, МасСтр.НДС, МасСтр.НДС / МасСтр.Количество * Стр.Количество);
			НС.ВаловаяПрибыль = -?(Стр.Количество = МасСтр.Количество, МасСтр.ВаловаяПрибыль, МасСтр.ВаловаяПрибыль / МасСтр.Количество * Стр.Количество);
		КонецЦикла;	
	КонецЦикла;	
КонецПроцедуры

Процедура УменьшитьПрибыльПоКорректировке(ДокОбъект, ОбъектРасчётов, Сумма)
	Движения = ДокОбъект.Движения;
	НЗ = РегистрыНакопления.Продажи.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(ОбъектРасчётов);
	НЗ.Прочитать();
	ТЗПрибыль = НЗ.Выгрузить();
	ВыручкаИтого = ТЗПрибыль.Итог("Выручка");
	СуммаОстаток = Сумма;
	КоличествоСтрок = ТЗПрибыль.Количество();
	НомерСтроки = 0;
	Для Каждого Стр Из ТЗПрибыль Цикл
		НомерСтроки = НомерСтроки + 1;
		НС = Движения.Продажи.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Стр,,"Количество,Себестоимость,ДополнительныеРасходы");
		НС.Период = ДокОбъект.Дата;
		НС.ХозяйственнаяОперация = ДокОбъект.ХозяйственнаяОперация;
		НС.Выручка = -?(НомерСтроки = КоличествоСтрок, СуммаОстаток, Стр.Выручка / ВыручкаИтого * Сумма);
		НС.НДС = - Стр.НДС / ВыручкаИтого * Сумма;
		НС.ВаловаяПрибыль = Стр.ВаловаяПрибыль / ВыручкаИтого * Сумма;
		СуммаОстаток = СуммаОстаток + НС.Выручка;
	КонецЦикла;	
КонецПроцедуры

Функция СформироватьДанные(ДокОбъект, ТЗТовары, Сотрудник, Контрагент, ДокументПродажи, ХозяйственнаяОперация, Ответственный = Неопределено, МестоХранения)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЫРАЗИТЬ(ТЗТовары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	                      |	ВЫРАЗИТЬ(ТЗТовары.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	                      |	ВЫРАЗИТЬ(ТЗТовары.Количество КАК ЧИСЛО) КАК Количество,
	                      |	ВЫРАЗИТЬ(ТЗТовары.СуммаСНДС КАК ЧИСЛО) КАК Выручка,
	                      |	ВЫРАЗИТЬ(ТЗТовары.СуммаНДС КАК ЧИСЛО) КАК НДС
	                      |ПОМЕСТИТЬ ВТТовары
	                      |ИЗ
	                      |	&ТЗТовары КАК ТЗТовары
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТЗПартии.ВидДвижения КАК ВидДвижения,
	                      |	ВЫРАЗИТЬ(ТЗПартии.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	                      |	ВЫРАЗИТЬ(ТЗПартии.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	                      |	ТЗПартии.Партия КАК Партия,
	                      |	ВЫРАЗИТЬ(ТЗПартии.Сумма КАК ЧИСЛО) КАК Себестоимость,
	                      |	ВЫРАЗИТЬ(ТЗПартии.Количество КАК ЧИСЛО) КАК Количество
	                      |ПОМЕСТИТЬ ВТПартии
	                      |ИЗ
	                      |	&ТЗПартии КАК ТЗПартии
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТЗДополнительныеРасходы.ВидДвижения КАК ВидДвижения,
	                      |	ВЫРАЗИТЬ(ТЗДополнительныеРасходы.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	                      |	ВЫРАЗИТЬ(ТЗДополнительныеРасходы.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	                      |	ТЗДополнительныеРасходы.Партия КАК Партия,
	                      |	ВЫРАЗИТЬ(ТЗДополнительныеРасходы.Сумма КАК ЧИСЛО) КАК Сумма
	                      |ПОМЕСТИТЬ ВЗДополнительныеРасходы
	                      |ИЗ
	                      |	&ТЗДополнительныеРасходы КАК ТЗДополнительныеРасходы
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВЗ.Номенклатура КАК Номенклатура,
	                      |	ВЗ.Характеристика КАК Характеристика,
	                      |	ВЗ.Партия КАК Партия,
	                      |	СУММА(ВЗ.Количество) КАК Количество,
	                      |	СУММА(ВЗ.Себестоимость) КАК Себестоимость,
	                      |	СУММА(ВЗ.ДополнительныеРасходы) КАК ДополнительныеРасходы
	                      |ПОМЕСТИТЬ ВТПартииРасходы
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ВТПартии.Номенклатура КАК Номенклатура,
	                      |		ВТПартии.Характеристика КАК Характеристика,
	                      |		ВТПартии.Партия КАК Партия,
	                      |		ВТПартии.Количество КАК Количество,
	                      |		ВТПартии.Себестоимость КАК Себестоимость,
	                      |		0 КАК ДополнительныеРасходы
	                      |	ИЗ
	                      |		ВТПартии КАК ВТПартии
	                      |	ГДЕ
	                      |		ВТПартии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		ВЗДополнительныеРасходы.Номенклатура,
	                      |		ВЗДополнительныеРасходы.Характеристика,
	                      |		ВЗДополнительныеРасходы.Партия,
	                      |		0,
	                      |		0,
	                      |		ВЗДополнительныеРасходы.Сумма
	                      |	ИЗ
	                      |		ВЗДополнительныеРасходы КАК ВЗДополнительныеРасходы
	                      |	ГДЕ
	                      |		ВЗДополнительныеРасходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)) КАК ВЗ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВЗ.Номенклатура,
	                      |	ВЗ.Характеристика,
	                      |	ВЗ.Партия
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	&Период КАК Период,
	                      |	&Организация КАК Организация,
	                      |	&Сотрудник КАК Сотрудник,
	                      |	&Контрагент КАК Контрагент,
	                      |	&ДокументПродажи КАК ДокументПродажи,
	                      |	&Ответственный КАК Ответственный,
	                      |	&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	                      |	&МестоХранения КАК МестоХранения,
	                      |	ВЗ.Номенклатура КАК Номенклатура,
	                      |	ВЗ.Характеристика КАК Характеристика,
	                      |	ВЗ.Партия КАК Партия,
	                      |	ВЗ.Количество КАК Количество,
	                      |	ВЗ.Себестоимость КАК Себестоимость,
	                      |	ВЗ.ДополнительныеРасходы КАК ДополнительныеРасходы,
	                      |	ВЗ.Выручка КАК Выручка,
	                      |	ВЗ.НДС КАК НДС,
	                      |	ВЗ.Выручка - ВЗ.Себестоимость - ВЗ.ДополнительныеРасходы КАК ВаловаяПрибыль
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ВЗ.Номенклатура КАК Номенклатура,
	                      |		ВЗ.Характеристика КАК Характеристика,
	                      |		ЕСТЬNULL(ВТПартииРасходы.Партия, НЕОПРЕДЕЛЕНО) КАК Партия,
	                      |		ЕСТЬNULL(ВТПартииРасходы.Количество, ВЗ.Количество) КАК Количество,
	                      |		ВЗ.Выручка / ВЗ.Количество * ЕСТЬNULL(ВТПартииРасходы.Количество, ВЗ.Количество) КАК Выручка,
	                      |		ВЗ.НДС / ВЗ.Количество * ЕСТЬNULL(ВТПартииРасходы.Количество, ВЗ.Количество) КАК НДС,
	                      |		ВЫБОР
	                      |			КОГДА ВЗ.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	                      |				ТОГДА ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)
	                      |			ИНАЧЕ ЕСТЬNULL(ВТПартииРасходы.Себестоимость, 0)
	                      |		КОНЕЦ КАК Себестоимость,
	                      |		ЕСТЬNULL(ВТПартииРасходы.ДополнительныеРасходы, 0) КАК ДополнительныеРасходы
	                      |	ИЗ
	                      |		(ВЫБРАТЬ
	                      |			ВТТовары.Номенклатура КАК Номенклатура,
	                      |			ВТТовары.Характеристика КАК Характеристика,
	                      |			СУММА(ВТТовары.Количество) КАК Количество,
	                      |			СУММА(ВТТовары.Выручка) КАК Выручка,
	                      |			СУММА(ВТТовары.НДС) КАК НДС
	                      |		ИЗ
	                      |			ВТТовары КАК ВТТовары
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			ВТТовары.Номенклатура,
	                      |			ВТТовары.Характеристика) КАК ВЗ
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ ВТПартииРасходы КАК ВТПартииРасходы
	                      |			ПО ВЗ.Номенклатура = ВТПартииРасходы.Номенклатура
	                      |				И ВЗ.Характеристика = ВТПартииРасходы.Характеристика
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, ) КАК ЦеныНоменклатуры
	                      |			ПО ВЗ.Номенклатура = ЦеныНоменклатуры.Номенклатура
	                      |				И ВЗ.Характеристика = ЦеныНоменклатуры.Характеристика
	                      |				И (ЦеныНоменклатуры.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.Закупочная))) КАК ВЗ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТПартии.Номенклатура КАК Номенклатура,
	                      |	ВТПартии.Характеристика КАК Характеристика,
	                      |	ВТПартии.Партия КАК Партия,
	                      |	ВТПартии.Количество КАК Количество
	                      |ИЗ
	                      |	ВТПартии КАК ВТПартии
	                      |ГДЕ
	                      |	ВТПартии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)");
	Запрос.УстановитьПараметр("ТЗТовары", ТЗТовары);
	Запрос.УстановитьПараметр("ТЗПартии", ПолучитьТЗПартииПоРеализации(ДокОбъект));
	Запрос.УстановитьПараметр("ТЗДополнительныеРасходы", ПолучитьДополнительныеРасходыПоРеализации(ДокОбъект));
	Запрос.УстановитьПараметр("Период", ДокОбъект.Дата);
	Запрос.УстановитьПараметр("Организация", ДокОбъект.Организация);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ДокументПродажи", ДокументПродажи);
	Запрос.УстановитьПараметр("МестоХранения", ДокументПродажи.МестоХранения);
	Запрос.УстановитьПараметр("Ответственный", Ответственный);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", ХозяйственнаяОперация);
	Возврат Запрос.ВыполнитьПакет();
КонецФункции	

#КонецОбласти

#Область Остатки

Функция ПолучитьВыручкуПоТоварнойГруппе(НачалоПериода, КонецПериода, МасСотрудники, ТоварнаяГруппа) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СУММА(ПродажиОбороты.ВыручкаОборот) КАК Сумма
	                      |ИЗ
	                      |	РегистрНакопления.Продажи.Обороты(
	                      |			&НачалоПериода,
	                      |			&КонецПериода,
	                      |			,
	                      |			ВЫБОР
	                      |					КОГДА &СотрудникиУказаны
	                      |						ТОГДА Сотрудник В (&Сотрудники)
	                      |					ИНАЧЕ ИСТИНА
	                      |				КОНЕЦ
	                      |				И Номенклатура.ТоварнаяГруппа = &ТоварнаяГруппа) КАК ПродажиОбороты");
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Сотрудники", МасСотрудники);
	Запрос.УстановитьПараметр("СотрудникиУказаны", МасСотрудники.Количество() > 0);
	Запрос.УстановитьПараметр("ТоварнаяГруппа", ТоварнаяГруппа);
	Возврат Запрос.Выполнить().Выгрузить().Итог("Сумма");
КонецФункции

#КонецОбласти

#Область Остатки_и_аналитика

Функция ПолучитьПроцентПланаПродажПоМенеджеру(Период, Менеджер, Показатель) Экспорт
	Структура = Новый Структура("План, Факт, Процент", 0, 0, 0);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПродажиОбороты.Сотрудник как Менеджер,
	                      |	СУММА(ПродажиОбороты.ВыручкаОборот) КАК Факт,
	                      |	СУММА(0) КАК План
	                      |ИЗ
	                      |	РегистрНакопления.Продажи.Обороты(&ДатаНач, &ДатаКон, Месяц, Сотрудник = &Менеджер) КАК ПродажиОбороты
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ПродажиОбороты.Сотрудник
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ПлановыеПоказателиСрезПоследних.Сотрудник,
	                      |	0,
	                      |	ПлановыеПоказателиСрезПоследних.План
	                      |ИЗ
	                      |	РегистрСведений.ПлановыеПоказатели.СрезПоследних(
	                      |			&ДатаНач,
	                      |			Сотрудник = &Менеджер
	                      |				И Показатель = &Показатель) КАК ПлановыеПоказателиСрезПоследних");
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(КонецМесяца(Период)));
	Запрос.УстановитьПараметр("Менеджер", Менеджер);
	Запрос.УстановитьПараметр("Показатель", Показатель);
	ТЗ = Запрос.Выполнить().Выгрузить();
	ТЗ.Свернуть("Менеджер", "Факт, План");
	Если ТЗ.Количество() > 0 Тогда
		Стр = ТЗ[0];
		Структура.План = Стр.План;
		Структура.Факт = Стр.Факт;
		Структура.Процент = ?(Стр.План = 0, 100, Окр(Стр.Факт / (Стр.План / 100)));
	КонецЕсли;	
	Возврат Структура;	
КонецФункции

Функция ПолучитьСуммуПоказателяПродажПоПараметру(НачалоПериода, КонецПериода, Отбор) Экспорт 
	МасКонтрагенты = Новый Массив;
	МасТоварныеГруппы = Новый Массив;
	Для Каждого Параметр Из Отбор.Параметры Цикл
		Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Контрагенты") Тогда
			МасКонтрагенты.Добавить(Параметр);
		ИначеЕсли ТипЗнч(Параметр) = Тип("СправочникСсылка.ТоварныеГруппы") Тогда
			МасТоварныеГруппы.Добавить(Параметр);
		КонецЕсли;	
	КонецЦикла;	
	//	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СУММА(ПродажиОбороты.КоличествоОборот) КАК Количество,
	                      |	СУММА(ПродажиОбороты.ВыручкаОборот) КАК Выручка,
	                      |	СУММА(ПродажиОбороты.ВаловаяПрибыльОборот) КАК Прибыль
	                      |ИЗ
	                      |	РегистрНакопления.Продажи.Обороты(
	                      |			&НачалоПериода,
	                      |			&КонецПериода,
	                      |			,
	                      |			ВЫБОР
	                      |					КОГДА &СотрудникиУказаны
	                      |						ТОГДА Сотрудник В (&Сотрудники)
	                      |					ИНАЧЕ ИСТИНА
	                      |				КОНЕЦ
	                      |				И ВЫБОР
	                      |					КОГДА &КонтрагентыУказаны
	                      |						ТОГДА Контрагент В (&Контрагенты)
	                      |					ИНАЧЕ ИСТИНА
	                      |				КОНЕЦ
	                      |				И ВЫБОР
	                      |					КОГДА &ТоварныеГруппыУказаны
	                      |						ТОГДА Номенклатура.ТоварнаяГруппа В (&ТоварныеГруппы)
	                      |					ИНАЧЕ ИСТИНА
	                      |				КОНЕЦ) КАК ПродажиОбороты");
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Сотрудники", Отбор.Сотрудник);
	Запрос.УстановитьПараметр("СотрудникиУказаны", Отбор.Сотрудник.Количество() > 0);
	Запрос.УстановитьПараметр("КонтрагентыУказаны", МасКонтрагенты.Количество() > 0);
	Запрос.УстановитьПараметр("Контрагенты", МасКонтрагенты);
	Запрос.УстановитьПараметр("ТоварныеГруппыУказаны", МасТоварныеГруппы.Количество() > 0);
	Запрос.УстановитьПараметр("ТоварныеГруппы", МасТоварныеГруппы);
	Если ЗначениеЗаполнено(Отбор.Показатель) Тогда
		ТЗ = Запрос.Выполнить().Выгрузить();
		Возврат ТЗ.Итог(Строка(Отбор.Показатель));
	Иначе
		Возврат 0;	
	КонецЕсли;
КонецФункции

Функция ПолучитьТаблицуПроцентыПланаРентабельностиПоМенеджеру(Период, Менеджер, Показатель) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПродажиОбороты.Сотрудник КАК Сотрудник,
	                      |	ПродажиОбороты.ДокументПродажи КАК ДокументПродажи,
	                      |	СУММА(ПродажиОбороты.ВаловаяПрибыльОборот) КАК Прибыль,
	                      |	СУММА(ПродажиОбороты.ВыручкаОборот) КАК Выручка,
	                      |	ВЫРАЗИТЬ(ЕСТЬNULL(ПлановыеПоказателиСрезПоследних.План, 0) КАК ЧИСЛО) КАК План
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	РегистрНакопления.Продажи.Обороты(&ДатаНач, &ДатаКон, Месяц, Сотрудник = &Менеджер) КАК ПродажиОбороты
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеПоказатели.СрезПоследних(
	                      |				&ДатаНач,
	                      |				Сотрудник = &Менеджер
	                      |					И Показатель = &Показатель) КАК ПлановыеПоказателиСрезПоследних
	                      |		ПО ПродажиОбороты.Сотрудник = ПлановыеПоказателиСрезПоследних.Сотрудник
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ПродажиОбороты.Сотрудник,
	                      |	ПродажиОбороты.ДокументПродажи,
	                      |	ВЫРАЗИТЬ(ЕСТЬNULL(ПлановыеПоказателиСрезПоследних.План, 0) КАК ЧИСЛО)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ.Сотрудник КАК Сотрудник,
	                      |	ВТ.ДокументПродажи КАК ДокументПродажи,
	                      |	ВТ.Прибыль КАК Прибыль,
	                      |	ВТ.План КАК План,
	                      |	ВЫРАЗИТЬ(ВЫБОР
	                      |			КОГДА ВТ.План = 0 или ВТ.Выручка = 0
	                      |				ТОГДА 100
	                      |			ИНАЧЕ ВТ.Прибыль / ВТ.Выручка * 100 / ВТ.План * 100
	                      |		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Процент
	                      |ИЗ
	                      |	ВТ КАК ВТ");
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(КонецМесяца(Период)));
	Запрос.УстановитьПараметр("Менеджер", Менеджер);
	Запрос.УстановитьПараметр("Показатель", Показатель);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ТЗ;	
КонецФункции

Функция ПолучитьТЗПартииПоРеализации(ДокОбъект)
	Если ДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.НакладнаяПоОтгрузкамТовара Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыВНаличии.Период КАК Период,
		|	ТоварыВНаличии.Регистратор КАК Регистратор,
		|	ТоварыВНаличии.НомерСтроки КАК НомерСтроки,
		|	ТоварыВНаличии.Активность КАК Активность,
		|	ТоварыВНаличии.ВидДвижения КАК ВидДвижения,
		|	ТоварыВНаличии.МестоХранения КАК МестоХранения,
		|	ТоварыВНаличии.Номенклатура КАК Номенклатура,
		|	ТоварыВНаличии.Характеристика КАК Характеристика,
		|	ТоварыВНаличии.Серия КАК Серия,
		|	ТоварыВНаличии.Партия КАК Партия,
		|	ТоварыВНаличии.ДатаПартии КАК ДатаПартии,
		|	ТоварыВНаличии.Количество КАК Количество,
		|	ТоварыВНаличии.Сумма КАК Сумма
		|ИЗ
		|	РегистрНакопления.ТоварыВНаличии КАК ТоварыВНаличии
		|ГДЕ
		|	ТоварыВНаличии.Регистратор В (&Регистратор)";
		Запрос.УстановитьПараметр("Регистратор", ДокОбъект.ТЧТовары.ВыгрузитьКолонку("ОтгрузкаТовара"));
		ТЗПартии = Запрос.Выполнить().Выгрузить();
	Иначе
		ТЗПартии = ДокОбъект.Движения.ТоварыВНаличии.Выгрузить();
	КонецЕсли;
	Возврат ТЗПартии;
КонецФункции

Функция ПолучитьДополнительныеРасходыПоРеализации(ДокОбъект)
	Если ДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.НакладнаяПоОтгрузкамТовара Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеРасходы.Период КАК Период,
		|	ДополнительныеРасходы.Регистратор КАК Регистратор,
		|	ДополнительныеРасходы.НомерСтроки КАК НомерСтроки,
		|	ДополнительныеРасходы.Активность КАК Активность,
		|	ДополнительныеРасходы.ВидДвижения КАК ВидДвижения,
		|	ДополнительныеРасходы.МестоХранения КАК МестоХранения,
		|	ДополнительныеРасходы.Номенклатура КАК Номенклатура,
		|	ДополнительныеРасходы.Характеристика КАК Характеристика,
		|	ДополнительныеРасходы.Серия КАК Серия,
		|	ДополнительныеРасходы.Партия КАК Партия,
		|	ДополнительныеРасходы.СтатьяДДС КАК СтатьяДДС,
		|	ДополнительныеРасходы.Сумма КАК Сумма
		|ИЗ
		|	РегистрНакопления.ДополнительныеРасходы КАК ДополнительныеРасходы
		|ГДЕ
		|	ДополнительныеРасходы.Регистратор В(&Регистратор)";
		Запрос.УстановитьПараметр("Регистратор", ДокОбъект.ТЧТовары.ВыгрузитьКолонку("ОтгрузкаТовара"));
		ТЗПартии = Запрос.Выполнить().Выгрузить();
	Иначе
		ТЗПартии = ДокОбъект.Движения.ДополнительныеРасходы.Выгрузить();
	КонецЕсли;
	Возврат ТЗПартии;
КонецФункции

#КонецОбласти
